Revit 2024 API
BalusterPattern.BreakPattern Property
 The condition which controls breaking baluster patterns distribution.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2019
Syntax
C#
public BreakPatternCondition BreakPattern { get; set; }
Visual Basic
Public Property BreakPattern As BreakPatternCondition
	Get
	Set
Visual C++
public:
property BreakPatternCondition BreakPattern {
	BreakPatternCondition get ();
	void set (BreakPatternCondition value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
BalusterPattern Class
Autodesk.Revit.DB.Architecture Namespace